{
	"version": "https://jsonfeed.org/version/1",
	"title": "Jake Weidokal",
	"icon": "https://micro.blog/jaek/avatar.jpg",
	"home_page_url": "https://weidok.al/",
	"feed_url": "https://weidok.al/feed.json",
	"items": [
		
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/30/scritch-scratch-swoop.html",
				
				"content_html": "<p>scritch scratch swoop and slash<br>\nfurious scribbles relent<br>\ntaut hush, reflection</p>\n",
				"content_text": "scritch scratch swoop and slash  \r\nfurious scribbles relent  \r\ntaut hush, reflection  \n",
				"date_published": "2024-05-30T10:51:29-04:00",
				"url": "https://weidok.al/2024/05/30/scritch-scratch-swoop.html",
				"tags": ["notes","haiku"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/29/my-new-shipment.html",
				"title": "Experimentation Is Where the Fun Is At!",
				"content_html": "<p>My new shipment from <a href=\"https://www.gouletpens.com/\">The Goulet Pen Company</a> makes it feel like Christmas!</p>\n<!-- raw HTML omitted -->\n<p>I ordered their <a href=\"https://www.gouletpens.com/collections/all-paper/products/notebook-sampler-package-set#\">notebook sampler</a> and got a <a href=\"https://www.gouletpens.com/collections/random-ink-sample-set/products/ink-sample-package-surprise-me#\">random ink sample set</a> for free.</p>\n<p>I&rsquo;ve barely tested the notebooks so far, but I&rsquo;m <em>really</em> liking the Goulet notebook with Tomoe River paper. It felt silky smooth and the lines of the ink were the most crisp I&rsquo;ve seen. All the notebooks seem great though. I&rsquo;m going to have fun trying them out!</p>\n<p>I&rsquo;m a little bummed that the Goulet notebook came in the pocket size instead of the passport size, because I use a passport size traveler&rsquo;s notebook as a pocket journal/wallet. In the future, I think I&rsquo;ll be buying the Tomoe River refills instead of the standard Traveler&rsquo;s Notebook (TN) refills. Although TN paper is from Midori and is quite nice too. I found that the TN paper was the most toothy of the notebooks in the sampler.</p>\n<p>The notebooks all have &ldquo;premium&rdquo; paper ideal for fountain pens, and include:</p>\n<ul>\n<li><a href=\"https://www.gouletpens.com/products/apica-cd-5-notebook-pastel-assorted-colors-lined\">Apica CD-5</a></li>\n<li><a href=\"https://www.gouletpens.com/products/clairefontaine-classic-staplebound-a4-notebook-lined\">Clairefontaine Staplebound</a></li>\n<li><a href=\"https://www.gouletpens.com/products/goulet-notebook-68gsm-tomoe-river-paper-pocket-dot-grid\">Goulet Notebook (68gsm Tomoe River Paper)</a></li>\n<li><a href=\"https://www.gouletpens.com/products/maruman-mnemosyne-n192-b7-notepad-lined\">Maruman Mnemosyne N192 B7 Notepad</a></li>\n<li><a href=\"https://www.gouletpens.com/products/travelers-notebook-passport-refill-001-lined\">Traveler&rsquo;s Notebook Refill 001 Passport size</a></li>\n<li><a href=\"https://www.gouletpens.com/products/rhodia-no-12-notepad-black-dot-grid\">Rhodia No. 12</a></li>\n</ul>\n<p>In my random ink sample set I received the eight inks on the left, including:</p>\n<ul>\n<li><a href=\"https://www.gouletpens.com/products/diamine-terracotta-40ml-bottled-ink\">Diamine Terracotta</a></li>\n<li><a href=\"https://www.gouletpens.com/products/sailor-ink-studio-143-20ml-bottled-ink\">Sailor Ink Studio 143</a></li>\n<li><a href=\"https://www.gouletpens.com/products/sailor-seiboku-pigmented-blue-50ml-bottled-ink\">Sailor Seiboku Pigmented Blue Black</a></li>\n<li><a href=\"https://www.gouletpens.com/products/sailor-ink-studio-150-20ml-bottled-ink\">Sailor Ink Studio 150</a></li>\n<li><a href=\"https://www.gouletpens.com/products/sailor-yurameku-amamoyoi-20ml-bottled-ink\">Sailor Yurameku Amamoyoi</a></li>\n<li><a href=\"https://www.gouletpens.com/products/private-reserve-infinity-black-30ml-bottled-ink\">Private Reserve Infinity Black</a></li>\n<li><a href=\"https://www.gouletpens.com/products/sailor-ink-studio-023-20ml-bottled-ink\">Sailor Ink Studio 023</a></li>\n<li><a href=\"https://www.gouletpens.com/products/diamine-onyx-black-30ml-bottled-ink\">Diamine Onyx Black</a></li>\n</ul>\n<p>The other inks pictured on the right were from a sample set I picked up from Goulet a while back.</p>\n<p>I still haven&rsquo;t gone in on a full-size bottle of ink. Back in college I had a Pilot Iroshizuku bottle, but I don&rsquo;t remember what I did with it. I think I gave it to a friend. Now I&rsquo;m having fun trying out samples! My journal is eclectic with different colors and shades all over the place, but I like that. It will be fun to look back and see what I was experimenting with at different times.</p>\n<p>Maybe someday I&rsquo;ll settle on a nice journal/pen/ink combo I can rock forever, but I&rsquo;m okay if that never happens. Experimentation is where the fun is at!</p>",
				"content_text": "My new shipment from [The Goulet Pen Company](https://www.gouletpens.com/) makes it feel like Christmas!\n\n<img src=\"uploads/2024/notebook-and-ink-samplers.jpg\" width=\"600\" height=\"370\" alt=\"Six pocket notebooks and sixteen different colorful ink swatches arranged on a light wooden desk\">\n\nI ordered their [notebook sampler](https://www.gouletpens.com/collections/all-paper/products/notebook-sampler-package-set#) and got a [random ink sample set](https://www.gouletpens.com/collections/random-ink-sample-set/products/ink-sample-package-surprise-me#) for free.\n\n<!--more-->\n\nI've barely tested the notebooks so far, but I'm *really* liking the Goulet notebook with Tomoe River paper. It felt silky smooth and the lines of the ink were the most crisp I've seen. All the notebooks seem great though. I'm going to have fun trying them out!\n\nI'm a little bummed that the Goulet notebook came in the pocket size instead of the passport size, because I use a passport size traveler's notebook as a pocket journal/wallet. In the future, I think I'll be buying the Tomoe River refills instead of the standard Traveler's Notebook (TN) refills. Although TN paper is from Midori and is quite nice too. I found that the TN paper was the most toothy of the notebooks in the sampler.\n\nThe notebooks all have \"premium\" paper ideal for fountain pens, and include:\n\n- [Apica CD-5](https://www.gouletpens.com/products/apica-cd-5-notebook-pastel-assorted-colors-lined)\n- [Clairefontaine Staplebound](https://www.gouletpens.com/products/clairefontaine-classic-staplebound-a4-notebook-lined)\n- [Goulet Notebook (68gsm Tomoe River Paper)](https://www.gouletpens.com/products/goulet-notebook-68gsm-tomoe-river-paper-pocket-dot-grid)\n- [Maruman Mnemosyne N192 B7 Notepad](https://www.gouletpens.com/products/maruman-mnemosyne-n192-b7-notepad-lined)\n- [Traveler's Notebook Refill 001 Passport size](https://www.gouletpens.com/products/travelers-notebook-passport-refill-001-lined)\n- [Rhodia No. 12](https://www.gouletpens.com/products/rhodia-no-12-notepad-black-dot-grid)\n\nIn my random ink sample set I received the eight inks on the left, including:\n\n- [Diamine Terracotta](https://www.gouletpens.com/products/diamine-terracotta-40ml-bottled-ink)\n- [Sailor Ink Studio 143](https://www.gouletpens.com/products/sailor-ink-studio-143-20ml-bottled-ink)\n- [Sailor Seiboku Pigmented Blue Black](https://www.gouletpens.com/products/sailor-seiboku-pigmented-blue-50ml-bottled-ink)\n- [Sailor Ink Studio 150](https://www.gouletpens.com/products/sailor-ink-studio-150-20ml-bottled-ink)\n- [Sailor Yurameku Amamoyoi](https://www.gouletpens.com/products/sailor-yurameku-amamoyoi-20ml-bottled-ink)\n- [Private Reserve Infinity Black](https://www.gouletpens.com/products/private-reserve-infinity-black-30ml-bottled-ink)\n- [Sailor Ink Studio 023](https://www.gouletpens.com/products/sailor-ink-studio-023-20ml-bottled-ink)\n- [Diamine Onyx Black](https://www.gouletpens.com/products/diamine-onyx-black-30ml-bottled-ink)\n\nThe other inks pictured on the right were from a sample set I picked up from Goulet a while back.\n\nI still haven't gone in on a full-size bottle of ink. Back in college I had a Pilot Iroshizuku bottle, but I don't remember what I did with it. I think I gave it to a friend. Now I'm having fun trying out samples! My journal is eclectic with different colors and shades all over the place, but I like that. It will be fun to look back and see what I was experimenting with at different times.\n\nMaybe someday I'll settle on a nice journal/pen/ink combo I can rock forever, but I'm okay if that never happens. Experimentation is where the fun is at!\n",
				"date_published": "2024-05-29T23:30:22-04:00",
				"url": "https://weidok.al/2024/05/29/my-new-shipment.html",
				"tags": ["journaling","articles"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/26/an-analog-blog.html",
				"title": "An Analog Blog Post",
				"content_html": "<p><img src=\"https://weidok.al/uploads/2024/media.jpg\" alt=\"A journal and Lamy Safari fountain pen on a dark stained wood table\"></p>\n<p><em>The following was transcribed from the pictured journal entry. I used Google Lens and a LOT of editing.</em></p>\n<p>It has been easy to <strong>not</strong> make time to write recently. &ldquo;Busyness&rdquo; is the main culprit, but I&rsquo;ve also been spending time with its less boisterous sibling, distraction. And so here I find myself, back at the roots of my writing practice. The journal. I&rsquo;ve missed the empty page. The empty screen is nice too, in my writing software of choice, but I can&rsquo;t help feeling the weight of the myriad windows/apps/messages vying for my attention. So I&rsquo;ve returned to my empty page. It welcomes my attention and thought, but does not compete for them. It is an escape in plain sight.</p>\n<p>The past couple weeks have been especially tricky with a sick daughter who doesn&rsquo;t want to sleep, a busy and understaffed season at work, and all sorts of house projects begging to be completed. All these things are important to give my time to, but I miss having time alone to work through my thoughts. And there is something unique to working through thoughts with pen and paper. It would be interesting to see how a particular thought path might develop differently if done digitally instead of analog. Digital thoughts can be discarded and reshaped much more easily. Analog thoughts are methodical and more planned out. Each word, each sentence, gets much more thought. There is no turning back.</p>\n<p>It&rsquo;s so fun to see where thoughts lead me. I thought this would be an entry about busyness and distraction, but my mind seems more stuck on the difference between digital and analog mediums for thought exploration. Having a medium to capture your thoughts is useful, but how does the medium shape your thoughts? Is it better to be able to edit and rearrange your thoughts easily, or is it better, to follow a slow, linear progression? Or is it just different? If I had written this digitally, I might have edited the first paragraph to have a smoother segue, but I would have lost the original idea that led me to where I am now. Analog forces a full historical record. It takes a longer time to adjust course or backtrack, but you won&rsquo;t lose where you started. How many beautiful, half-baked thoughts have been lost in the editing phase of digital writing? Yet on the other side of the coin, dead branches should be pruned so that the healthy ones can grow stronger.</p>\n<p>It would be nice to have the benefits of both analog and digital. I need someone to build a small microwave-style device that scans a notebook in its entirety, and then some sort of local, air-gapped Al separates and tags the content appropriately, moving it to my note app of choice. A dreamer has to dream. The major downfall of analog is how hard it is to re-surface at a later time. There are indexing and categorization systems that help with this, but they don&rsquo;t come close to what I can do digitally.</p>\n<p>The experience of writing something new is so nice in analog though. Flip to an empty page, grab your writing utensil, and get going. I get the physical feedback of the pen, the sound of each stroke on the page, and my writing style is distinctly &ldquo;mine&rdquo;. I contrast that with my phone, where I feel obligated to read each notification before I get started writing. That is, if I even make it there without getting lost chasing a squirrel. It&rsquo;s not as good with a laptop either. I have to pull it out, boot it up, find my app, and make my way to a blank space for writing. It&rsquo;s not too much longer, but it feels so much further away than pen and paper.</p>\n<p>This sounds a bit like digital-bashing, but I prefer it in many cases. I&rsquo;ve just been spending too much time there recently, and not enough time with my pen and paper. Here&rsquo;s to more time with my ad-free journal.</p>",
				"content_text": "![A journal and Lamy Safari fountain pen on a dark stained wood table](https://weidok.al/uploads/2024/media.jpg)\n\n*The following was transcribed from the pictured journal entry. I used Google Lens and a LOT of editing.*\n\nIt has been easy to **not** make time to write recently. \"Busyness\" is the main culprit, but I've also been spending time with its less boisterous sibling, distraction. And so here I find myself, back at the roots of my writing practice. The journal. I've missed the empty page. The empty screen is nice too, in my writing software of choice, but I can't help feeling the weight of the myriad windows/apps/messages vying for my attention. So I've returned to my empty page. It welcomes my attention and thought, but does not compete for them. It is an escape in plain sight.\n\n<!--more-->\n\nThe past couple weeks have been especially tricky with a sick daughter who doesn't want to sleep, a busy and understaffed season at work, and all sorts of house projects begging to be completed. All these things are important to give my time to, but I miss having time alone to work through my thoughts. And there is something unique to working through thoughts with pen and paper. It would be interesting to see how a particular thought path might develop differently if done digitally instead of analog. Digital thoughts can be discarded and reshaped much more easily. Analog thoughts are methodical and more planned out. Each word, each sentence, gets much more thought. There is no turning back.\n\nIt's so fun to see where thoughts lead me. I thought this would be an entry about busyness and distraction, but my mind seems more stuck on the difference between digital and analog mediums for thought exploration. Having a medium to capture your thoughts is useful, but how does the medium shape your thoughts? Is it better to be able to edit and rearrange your thoughts easily, or is it better, to follow a slow, linear progression? Or is it just different? If I had written this digitally, I might have edited the first paragraph to have a smoother segue, but I would have lost the original idea that led me to where I am now. Analog forces a full historical record. It takes a longer time to adjust course or backtrack, but you won't lose where you started. How many beautiful, half-baked thoughts have been lost in the editing phase of digital writing? Yet on the other side of the coin, dead branches should be pruned so that the healthy ones can grow stronger.\n\nIt would be nice to have the benefits of both analog and digital. I need someone to build a small microwave-style device that scans a notebook in its entirety, and then some sort of local, air-gapped Al separates and tags the content appropriately, moving it to my note app of choice. A dreamer has to dream. The major downfall of analog is how hard it is to re-surface at a later time. There are indexing and categorization systems that help with this, but they don't come close to what I can do digitally.\n\nThe experience of writing something new is so nice in analog though. Flip to an empty page, grab your writing utensil, and get going. I get the physical feedback of the pen, the sound of each stroke on the page, and my writing style is distinctly \"mine\". I contrast that with my phone, where I feel obligated to read each notification before I get started writing. That is, if I even make it there without getting lost chasing a squirrel. It's not as good with a laptop either. I have to pull it out, boot it up, find my app, and make my way to a blank space for writing. It's not too much longer, but it feels so much further away than pen and paper.\n\nThis sounds a bit like digital-bashing, but I prefer it in many cases. I've just been spending too much time there recently, and not enough time with my pen and paper. Here's to more time with my ad-free journal.\n",
				"date_published": "2024-05-26T10:13:09-04:00",
				"url": "https://weidok.al/2024/05/26/an-analog-blog.html",
				"tags": ["journaling","articles"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/25/theres-some-nice.html",
				
				"content_html": "<p>There&rsquo;s some nice footage of Sierra Space&rsquo;s Dream Chaser at the Armstrong Test Facility in Sandusky, Ohio at the 2:00 minute timestamp of this week&rsquo;s TW@N video 😁 We have neat facilities out here in The Land! <a href=\"https://youtu.be/xQeA-KzTL34?si=ztv71y5VLRV3ViOg\">youtu.be/xQeA-KzTL&hellip;</a></p>\n",
				"content_text": "There's some nice footage of Sierra Space's Dream Chaser at the Armstrong Test Facility in Sandusky, Ohio at the 2:00 minute timestamp of this week's TW@N video 😁 We have neat facilities out here in The Land! [youtu.be/xQeA-KzTL...](https://youtu.be/xQeA-KzTL34?si=ztv71y5VLRV3ViOg)\n",
				"date_published": "2024-05-25T16:28:43-04:00",
				"url": "https://weidok.al/2024/05/25/theres-some-nice.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/25/i-just-used.html",
				
				"content_html": "<p>I just used the Google Assistant to make a reservation this morning and it was pretty nice. It waited until the restaurant was open to call and then sent me a text confirming the reservation.</p>\n",
				"content_text": "I just used the Google Assistant to make a reservation this morning and it was pretty nice. It waited until the restaurant was open to call and then sent me a text confirming the reservation.\n",
				"date_published": "2024-05-25T09:50:17-04:00",
				"url": "https://weidok.al/2024/05/25/i-just-used.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/25/i-replaced-our.html",
				
				"content_html": "<p>I replaced our mulch with gravel and started our first garden! We will have cucumbers and three varieties of bell pepper. 🪨🥒🫑</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "I replaced our mulch with gravel and started our first garden! We will have cucumbers and three varieties of bell pepper. 🪨🥒🫑\n\n<img src=\"https://cdn.uploads.micro.blog/139317/2024/1dd78945dc.jpg\" width=\"600\" height=\"450\" alt=\"A blue house with a red door and a gravel flower bed with juniper bushes.\"><img src=\"https://cdn.uploads.micro.blog/139317/2024/9b18d38019.jpg\" width=\"450\" height=\"600\" alt=\"A 4x8 raised bed garden with grass and a pond in the background.\">\n",
				"date_published": "2024-05-25T09:32:41-04:00",
				"url": "https://weidok.al/2024/05/25/i-replaced-our.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/22/ever-wondered-what.html",
				
				"content_html": "<p>Ever wondered what the heck that fancy ChatGPT Large Language Model AI is <em>actually</em> doing? This animated 3D visualization is an awesome step-by-step guide! <a href=\"https://bbycroft.net/llm\">bbycroft.net/llm</a></p>\n",
				"content_text": "Ever wondered what the heck that fancy ChatGPT Large Language Model AI is _actually_ doing? This animated 3D visualization is an awesome step-by-step guide! [bbycroft.net/llm](https://bbycroft.net/llm)\n",
				"date_published": "2024-05-22T11:31:24-04:00",
				"url": "https://weidok.al/2024/05/22/ever-wondered-what.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/16/felt-good-to.html",
				
				"content_html": "<p>Felt good to be back on the grill yesterday!</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Felt good to be back on the grill yesterday!\n\n<img src=\"https://cdn.uploads.micro.blog/139317/2024/b170882185.jpg\" width=\"600\" height=\"450\" alt=\"A pit Boss pellet grill with smoke coming out.\">\n",
				"date_published": "2024-05-16T10:15:02-04:00",
				"url": "https://weidok.al/2024/05/16/felt-good-to.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/15/can-you-tell.html",
				
				"content_html": "<p>Can you tell which is the original&hellip;? 😅</p>\n<p>I asked <a href=\"https://chatgpt.com\">GPT-4o</a> to describe an image of me, and then fed the generated text into <a href=\"https://designer.microsoft.com/\">Microsoft Designer</a> to see how well it could generate a copy of me. Microsoft Designer turned the handsome-dial a little too high, but this is impressive!</p>\n<p>Here&rsquo;s the description that was generated from the original:</p>\n<blockquote>\n<p>The image shows a young man with short, neatly trimmed hair and a light beard. He is smiling warmly, showing his teeth. He is wearing a gray zip-up sweater. The background is an outdoor setting with blurred trees and foliage, suggesting it might be a park or a natural area. The overall mood of the image is friendly and relaxed.</p>\n</blockquote>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Can you tell which is the original...? 😅\r\n\r\nI asked [GPT-4o](https://chatgpt.com) to describe an image of me, and then fed the generated text into [Microsoft Designer](https://designer.microsoft.com/) to see how well it could generate a copy of me. Microsoft Designer turned the handsome-dial a little too high, but this is impressive!\r\n\r\nHere's the description that was generated from the original:\r\n\r\n> The image shows a young man with short, neatly trimmed hair and a light beard. He is smiling warmly, showing his teeth. He is wearing a gray zip-up sweater. The background is an outdoor setting with blurred trees and foliage, suggesting it might be a park or a natural area. The overall mood of the image is friendly and relaxed.\n\n<img src=\"https://cdn.uploads.micro.blog/139317/2024/jake-headshot.jpg\" width=\"600\" height=\"600\" alt=\"Headshot photo of Jake\"><img src=\"https://cdn.uploads.micro.blog/139317/2024/gpt-jake.png\" width=\"600\" height=\"600\" alt=\"AI-generated copy of a headshot photo of Jake\">\n",
				"date_published": "2024-05-15T13:24:49-04:00",
				"url": "https://weidok.al/2024/05/15/can-you-tell.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/14/is-a-good.html",
				
				"content_html": "<p>Is 1285 a good score on Google&rsquo;s dino game? What are your high scores?</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Is 1285 a good score on Google's dino game? What are your high scores?\n\n<img src=\"https://cdn.uploads.micro.blog/139317/2024/90c694b702.png\" width=\"276\" height=\"600\" alt=\"Google's no internet page with the dinosaur game showing a score of 1285\">\n",
				"date_published": "2024-05-14T14:40:25-04:00",
				"url": "https://weidok.al/2024/05/14/is-a-good.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/14/check-the-categorization.html",
				"title": "Check the Categorization of Your Domain in Cloudflare Radar to Make Sure Federal Employees Can Visit Your Site",
				"content_html": "<p>My blog is available on the NASA network now! For anyone else who wants their site to show up on a federal network, make sure you scan your domain at <a href=\"https://radar.cloudflare.com/\">https://radar.cloudflare.com/</a>. CISA uses Protective DNS, and Cloudflare is the provider behind that service. After scanning the URL, check the security tab to see if there are any security risks.</p>\n<!-- raw HTML omitted -->\n<p>If there are, then you&rsquo;ll need to request that your site be recategorized at this link: <a href=\"https://radar.cloudflare.com/domains/feedback\">https://radar.cloudflare.com/domains/feedback</a></p>\n<p>My site had originally been categorized as &ldquo;DGA Domain&rdquo;, which is a security risk, so I requested that categorization be removed. Cloudflare made the change within 24 hours, and now I can share my work-related blog posts with my coworkers!</p>",
				"content_text": "My blog is available on the NASA network now! For anyone else who wants their site to show up on a federal network, make sure you scan your domain at [https://radar.cloudflare.com/](https://radar.cloudflare.com/). CISA uses Protective DNS, and Cloudflare is the provider behind that service. After scanning the URL, check the security tab to see if there are any security risks.\n\n<!--more-->\n\n<img src=\"uploads/2024/2024-05-14-7-43-25.png\" width=\"600\" height=\"311\" alt=\"\">\n\nIf there are, then you'll need to request that your site be recategorized at this link: [https://radar.cloudflare.com/domains/feedback](https://radar.cloudflare.com/domains/feedback)\n\nMy site had originally been categorized as \"DGA Domain\", which is a security risk, so I requested that categorization be removed. Cloudflare made the change within 24 hours, and now I can share my work-related blog posts with my coworkers!\n",
				"date_published": "2024-05-14T07:51:18-04:00",
				"url": "https://weidok.al/2024/05/14/check-the-categorization.html",
				"tags": ["articles"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/14/i-updated-the.html",
				
				"content_html": "<p>I updated the font across my site to Inter instead of system-ui, which was the Tiny Theme default. I found out Tiny Theme has all sorts of pre-defined font groupings in main.css, so what I actually changed the font-family to was &ndash;font-neo-grotesque, of which the primary font was Inter. I like it!</p>\n",
				"content_text": "I updated the font across my site to Inter instead of system-ui, which was the Tiny Theme default. I found out Tiny Theme has all sorts of pre-defined font groupings in main.css, so what I actually changed the font-family to was --font-neo-grotesque, of which the primary font was Inter. I like it!\n",
				"date_published": "2024-05-14T06:28:22-04:00",
				"url": "https://weidok.al/2024/05/14/i-updated-the.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/13/is-this-a.html",
				"title": "Is this a blog or a node in a botnet?",
				"content_html": "<p>I finally found out why my blog was blocked on the NASA network! Cloudflare had it categorized as a <a href=\"https://en.wikipedia.org/wiki/Domain_generation_algorithm\">DGA Domain</a>, so they thought it was an autogenerated domain that was part of an evil botnet 🤦‍♂️ I&rsquo;ve submitted a request for Cloudflare to recategorize it under &ldquo;Personal Blogs&rdquo; so it doesn&rsquo;t show up as a security threat any more. I guess my last name does look a little suspect and not quite like a real word someone would use for a domain&hellip;</p>\n",
				"content_text": "I finally found out why my blog was blocked on the NASA network! Cloudflare had it categorized as a [DGA Domain](https://en.wikipedia.org/wiki/Domain_generation_algorithm), so they thought it was an autogenerated domain that was part of an evil botnet 🤦‍♂️ I've submitted a request for Cloudflare to recategorize it under \"Personal Blogs\" so it doesn't show up as a security threat any more. I guess my last name does look a little suspect and not quite like a real word someone would use for a domain...\n",
				"date_published": "2024-05-13T10:20:44-04:00",
				"url": "https://weidok.al/2024/05/13/is-this-a.html",
				"tags": ["articles"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/13/compound-and-leverage.html",
				"title": "Compound and Leverage",
				"content_html": "<p>Compound and leverage are powerful forces to move us toward our desired outcomes.</p>\n<p>I&rsquo;ve been thinking about these two forces and how they can be used not only to improve finances, but they also apply to other areas of life.</p>\n<p>When given consistent effort, some things will compound over time, like interest on money or the growth of a network. If we can identify these things, then we can give them small amounts of consistent effort to see amazing growth over the long term.</p>\n<p>On the other hand, leverage can be used to amplify your efforts for outsized returns. In finances, leverage usually means taking on debt to acquire assets. When done right, the assets bring in more dollars than the debt takes out.</p>\n<p>Compound plays the long game and trusts that what you put in will build upon itself.</p>\n<p>Leverage amplifies your efforts to turn little resources into big value.</p>\n<p>Consider the following ways you can put these forces to work for you:</p>\n<h2 id=\"compound\">Compound</h2>\n<ul>\n<li><strong>Business</strong>- Identify and complete 1 to 3 top tasks each day. You&rsquo;ll be amazed at what you&rsquo;ve done in a year.</li>\n<li><strong>Relationships</strong> - Take some time each day to reach out to friends or family. Consistent bits of time devoted to your relationships go a long way.</li>\n<li><strong>Network</strong> - Talk to new people and grow your network a little each week. The more it grows the easier it grows.</li>\n<li><strong>Money</strong> - Put some of each paycheck toward compound investments. At least put it into a high-yield savings account!</li>\n<li><strong>Health</strong> - Brush your teeth twice a day. Floss. Get enough sleep. Eat balanced, normal-sized portions. Exercise a couple times a week. You&rsquo;ll be superhuman in a year.</li>\n</ul>\n<h2 id=\"leverage\">Leverage</h2>\n<ul>\n<li><strong>Business</strong> - Spend the time to automate routine tasks. Use templates. Create process automations. Delegate when appropriate.</li>\n<li><strong>Relationships</strong> - Leverage other assets for growth in your relationships. Spend lavishly on a loved one to get them a meaningful gift. Use your time to write a heartfelt letter to a friend. Share your skills to help your family.</li>\n<li><strong>Network</strong> - Use your network to bring others into your network. Leverage events like conferences to find like-minded people who are also interested in finding you!</li>\n<li><strong>Money</strong> - Take on a loan to buy an asset that pays for the loan and then some. The loan lets you buy an asset larger than you could afford on your own, increasing your net worth as debt is paid off. Leveraging money is risky, so be smart and don&rsquo;t over-leverage. Have some reserves to get you out of a pickle if needed.</li>\n<li><strong>Health</strong> - Use your doctor! Leverage their years of medical knowledge to better understand your specific health situation.</li>\n</ul>\n<p>What other ways are you using compound and leverage? I&rsquo;m very curious to know!</p>\n<!-- raw HTML omitted -->",
				"content_text": "Compound and leverage are powerful forces to move us toward our desired outcomes.\n\nI've been thinking about these two forces and how they can be used not only to improve finances, but they also apply to other areas of life.\n\n<!--more-->\n\nWhen given consistent effort, some things will compound over time, like interest on money or the growth of a network. If we can identify these things, then we can give them small amounts of consistent effort to see amazing growth over the long term.\n\nOn the other hand, leverage can be used to amplify your efforts for outsized returns. In finances, leverage usually means taking on debt to acquire assets. When done right, the assets bring in more dollars than the debt takes out.\n\nCompound plays the long game and trusts that what you put in will build upon itself.\n\nLeverage amplifies your efforts to turn little resources into big value.\n\nConsider the following ways you can put these forces to work for you:\n\n## Compound\n\n- **Business**- Identify and complete 1 to 3 top tasks each day. You'll be amazed at what you've done in a year.\n- **Relationships** - Take some time each day to reach out to friends or family. Consistent bits of time devoted to your relationships go a long way.\n- **Network** - Talk to new people and grow your network a little each week. The more it grows the easier it grows.\n- **Money** - Put some of each paycheck toward compound investments. At least put it into a high-yield savings account!\n- **Health** - Brush your teeth twice a day. Floss. Get enough sleep. Eat balanced, normal-sized portions. Exercise a couple times a week. You'll be superhuman in a year.\n\n## Leverage\n\n- **Business** - Spend the time to automate routine tasks. Use templates. Create process automations. Delegate when appropriate.\n- **Relationships** - Leverage other assets for growth in your relationships. Spend lavishly on a loved one to get them a meaningful gift. Use your time to write a heartfelt letter to a friend. Share your skills to help your family.\n- **Network** - Use your network to bring others into your network. Leverage events like conferences to find like-minded people who are also interested in finding you!\n- **Money** - Take on a loan to buy an asset that pays for the loan and then some. The loan lets you buy an asset larger than you could afford on your own, increasing your net worth as debt is paid off. Leveraging money is risky, so be smart and don't over-leverage. Have some reserves to get you out of a pickle if needed.\n- **Health** - Use your doctor! Leverage their years of medical knowledge to better understand your specific health situation.\n\nWhat other ways are you using compound and leverage? I'm very curious to know!\n\n<img src=\"uploads/2024/img-20240512071332044.jpg\" width=\"450\" height=\"600\" alt=\"\">\n",
				"date_published": "2024-05-13T06:28:33-04:00",
				"url": "https://weidok.al/2024/05/13/compound-and-leverage.html",
				"tags": ["articles"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/12/im-worried-about.html",
				
				"content_html": "<p>I&rsquo;m worried about my blog undergoing a LinkedInification. A lot of my recent posts have been good candidates to cross post on LinkedIn, but when I&rsquo;m cross posting there I feel the tug to tweak my style for better &ldquo;engagement&rdquo;.</p>\n<p>I don&rsquo;t want that to drive what I write or how I write, so I&rsquo;m keeping an eye on it. I kinda like the idea of writing a full post on the blog, and then throwing a shorter summary version on LinkedIn, but that sounds like too much work. I&rsquo;ll have to give it some more thought.</p>\n",
				"content_text": "I'm worried about my blog undergoing a LinkedInification. A lot of my recent posts have been good candidates to cross post on LinkedIn, but when I'm cross posting there I feel the tug to tweak my style for better \"engagement\".\n\nI don't want that to drive what I write or how I write, so I'm keeping an eye on it. I kinda like the idea of writing a full post on the blog, and then throwing a shorter summary version on LinkedIn, but that sounds like too much work. I'll have to give it some more thought.\n",
				"date_published": "2024-05-12T21:11:31-04:00",
				"url": "https://weidok.al/2024/05/12/im-worried-about.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/12/happy-mothers-day.html",
				
				"content_html": "<p>Happy Mother&rsquo;s day to all the moms!</p>\n<p>Whether working or not, you matter. So thank you for all you do. ❤️</p>\n<p>I&rsquo;ve been blessed with an amazing mom and now I&rsquo;m married to an amazing mom, so I&rsquo;ve experienced the profound impact a good mom can have. Don&rsquo;t forget to thank a mom today!</p>\n",
				"content_text": "Happy Mother's day to all the moms!\n\nWhether working or not, you matter. So thank you for all you do. ❤️\n\nI've been blessed with an amazing mom and now I'm married to an amazing mom, so I've experienced the profound impact a good mom can have. Don't forget to thank a mom today!\n",
				"date_published": "2024-05-12T14:19:05-04:00",
				"url": "https://weidok.al/2024/05/12/happy-mothers-day.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/07/nasas-first-agile.html",
				"title": "NASA's First Agile Technical Interchange Meeting",
				"content_html": "<p>Yesterday was NASA&rsquo;s very first Agile Technical Interchange Meeting! NASA is becoming agile 🚀🏃‍♂️💨</p>\n<p>I learned how Agile is applied outside of my discipline, web software, to improve how we build hardware and integrated systems, particularly in the systems engineering discipline.</p>\n<p>Here are some ✨highlights✨ of NASA&rsquo;s agile journey:</p>\n<p>💙 Agile = respect. Tears were shed during a cybersecurity team&rsquo;s transition to SAFe (Scaled Agile Framework). Years of pent-up frustration and pain came out as the team realized how unseen they felt due to working in a very reactive manner, with requests coming in all over the place and no visibility into what they were accomplishing. Now their capacity is clearly understood by their customers and their leadership, and they are delivering more and happier than ever before.</p>\n<p>✈ Architecture affects agility. A team rearchitected their software to leverage microservices for coordinating drone traffic in lower-atmosphere urban air space. The architecture change has allowed them to be much more agile in how they deploy software.</p>\n<p>🌐 NASA does open-source!? I heard from the OpenMDAO team about how they are building open-source software from NASA, and how adapting an agile mindset has allowed them to respond and work with the open-source community.</p>\n<p>🔬 An agile mindset helps deliver valuable research. Much research happens at NASA, and adopting an agile mindset/approach is helping researchers think about how they deliver value with their research. This approach is not taught in doctorate programs, so it was fascinating to see the melding of these concepts and how important it is that NASA is thoughtful about what value our research products can deliver!</p>\n<p>We have a ways to go, but we&rsquo;re on our way! I&rsquo;m looking forward to staying connected with this community and seeing what else can be done with an agile mindset at NASA - National Aeronautics and Space Administration!</p>\n<p>Photo credit: Jackelynne Silva-Martinez, PhD</p>\n<!-- raw HTML omitted -->",
				"content_text": "Yesterday was NASA's very first Agile Technical Interchange Meeting! NASA is becoming agile 🚀🏃‍♂️💨\n\nI learned how Agile is applied outside of my discipline, web software, to improve how we build hardware and integrated systems, particularly in the systems engineering discipline.\n\n<!--more-->\n\nHere are some ✨highlights✨ of NASA's agile journey:\n\n💙 Agile = respect. Tears were shed during a cybersecurity team's transition to SAFe (Scaled Agile Framework). Years of pent-up frustration and pain came out as the team realized how unseen they felt due to working in a very reactive manner, with requests coming in all over the place and no visibility into what they were accomplishing. Now their capacity is clearly understood by their customers and their leadership, and they are delivering more and happier than ever before.\n\n✈ Architecture affects agility. A team rearchitected their software to leverage microservices for coordinating drone traffic in lower-atmosphere urban air space. The architecture change has allowed them to be much more agile in how they deploy software.\n\n🌐 NASA does open-source!? I heard from the OpenMDAO team about how they are building open-source software from NASA, and how adapting an agile mindset has allowed them to respond and work with the open-source community.\n\n🔬 An agile mindset helps deliver valuable research. Much research happens at NASA, and adopting an agile mindset/approach is helping researchers think about how they deliver value with their research. This approach is not taught in doctorate programs, so it was fascinating to see the melding of these concepts and how important it is that NASA is thoughtful about what value our research products can deliver!\n\nWe have a ways to go, but we're on our way! I'm looking forward to staying connected with this community and seeing what else can be done with an agile mindset at NASA - National Aeronautics and Space Administration!\n\nPhoto credit: Jackelynne Silva-Martinez, PhD\n\n<img src=\"uploads/2024/me-at-agile-tim.jpg\" width=\"600\" height=\"324\" alt=\"Jake sitting with other nasa agile practitioners in a conference room\">\n",
				"date_published": "2024-05-07T12:21:21-04:00",
				"url": "https://weidok.al/2024/05/07/nasas-first-agile.html",
				"tags": ["articles"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/06/the-team-at.html",
				
				"content_html": "<p>The team at <a href=\"https://www.snipd.com/\">Snipd</a> is coming up with some great AI use cases for podcasts. I enjoy interview/discussion style podcasts, so I&rsquo;m usually more interested in the guest than the podcast host. This new guest feature is going to be awesome!</p>\n<blockquote>\n<p>Releasing: Podcast Guests ✨</p>\n<p>On the latest version of the app, you can now:</p>\n<p>👱 View a guest&rsquo;s name, bio &amp; picture<br>\n🎙️ Explore more episodes with the same guest<br>\n👣 Follow your favorite guests<br>\n🔍 Discover similar guests</p>\n</blockquote>\n<!-- raw HTML omitted -->\n",
				"content_text": "The team at [Snipd](https://www.snipd.com/) is coming up with some great AI use cases for podcasts. I enjoy interview/discussion style podcasts, so I'm usually more interested in the guest than the podcast host. This new guest feature is going to be awesome!\n\n> Releasing: Podcast Guests ✨\n>\n> On the latest version of the app, you can now:\n>\n> 👱 View a guest's name, bio & picture  \n> 🎙️ Explore more episodes with the same guest  \n> 👣 Follow your favorite guests  \n> 🔍 Discover similar guests  \n\n<img src=\"https://cdn.uploads.micro.blog/139317/2024/dd1f9df23a.jpg\" width=\"436\" height=\"600\" alt=\"Luis von ahn guest page on snipd\">\n",
				"date_published": "2024-05-06T21:42:49-04:00",
				"url": "https://weidok.al/2024/05/06/the-team-at.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/05/enjoying-a-local.html",
				
				"content_html": "<p>Enjoying a local park before church</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Enjoying a local park before church\n\n<img src=\"https://cdn.uploads.micro.blog/139317/2024/2cb7bb4654.jpg\" width=\"600\" height=\"450\" alt=\"Concrete pathway leading to a picnic table on a peninsula surrounded by water\"><img src=\"https://cdn.uploads.micro.blog/139317/2024/71de1c4aba.jpg\" width=\"600\" height=\"450\" alt=\"A goose perched atop a rock\">\n",
				"date_published": "2024-05-05T09:14:04-04:00",
				"url": "https://weidok.al/2024/05/05/enjoying-a-local.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/05/now.html",
				"title": "Now 2024-05-05",
				"content_html": "<p><em>Also available on my <a href=\"https://weidok.al/now/\">/now page</a></em></p>\n<h3 id=\"dad-stuff\">Dad Stuff</h3>\n<p>My daughter is 10 months old! Time is flying. It seems like she has learned something new every couple of days. As I write, the newest developments are that her top front teeth are coming in, she&rsquo;s loving waving and clapping, we&rsquo;re trying out cloth diapers, and when we ask her to say &ldquo;dada&rdquo; or &ldquo;mama&rdquo; she consistently replies &ldquo;dada&rdquo; to either.</p>\n<p>I&rsquo;m soaking up every moment with her, particularly laying on the floor and letting her crawl over and attack me while we giggle together. I got teary-eyed the other day as I held her while she slept and I thought about how someday I won&rsquo;t be able to hold her anymore and these days will feel like a distant, warm memory. All the more reason to really be present, put the phone down, and take in each moment as completely as I can.</p>\n<h3 id=\"creating\">Creating</h3>\n<p>I&rsquo;ve been feeling extra creative lately! I&rsquo;ve been writing on the blog, I set up a digital garden at <a href=\"https://garden.weidok.al\">garden.weidok.al</a>, which I am mostly using to share my sermon notes and Readwise notes, and I created an app called <a href=\"https://weidok.al/2024/05/03/introducing-fed-meetup.html\">Fed Meetup</a>! I would have thought that becoming a dad meant I would have way less time, but somehow it has opened me up to being more creative. Funny how things work out not at all how I expect!</p>\n<p>I&rsquo;ve also been considering starting up a newsletter. I like the idea of having a commitment to write weekly within a single topic, and writing about something that is useful to others. The newsletter would be for average computer users/office workers, and would be about tips to use a computer just a little bit better. Things like hotkeys, workflows, apps, lesser-known parts of the OS, or anything that could help people be just a touch more efficient on a computer. If that sounds like something you would read and subscribe to, <a href=\"mailto:jake@weidok.al\">let me know</a>!</p>\n<h3 id=\"work\">Work</h3>\n<p>We launched the NASA Cause Analysis Tool! I&rsquo;ve been the product manager for this app since it was approved to be funded back in April of last year, and it&rsquo;s hard for me to believe that we already have working production software! Now that it&rsquo;s released, we&rsquo;re focused on releasing it, again and again. There&rsquo;s a lot more functionality yet to be added, but I&rsquo;m excited to have it available to users so we can get feedback as we build new increments. I&rsquo;d like to write a post sharing more about this.</p>\n<p>It&rsquo;s performance review time of the year at NASA, so I just finished up my self-assessment and feedback for coworkers. I&rsquo;m learning to love this time of year, as it forces me to reflect on the past year, which is something I would like myself to do anyways. I&rsquo;m thinking about writing a blog post about my highlights from this year at NASA.</p>\n<p>There are so many exciting things going on right now, some of them I briefly mentioned in <a href=\"https://weidok.al/2024/04/30/a-day-in.html\">my post about my day earlier this week</a>. While it&rsquo;s busy, I feel fortunate to be in this place at this time. I would have never thought I&rsquo;d be doing all these cool things and working on projects that reach across the whole agency.</p>\n<h3 id=\"faith-and-friends\">Faith and Friends</h3>\n<p>So many babies are being born! I&rsquo;m not sure how many since my last update, but I think we&rsquo;ve added around 5 new babies among our church group since then. It has been fun sharing the joy with everyone and helping out by participating in meal trains.</p>\n<p>I&rsquo;ve been really enjoying taking sermon notes in Obsidian, and then <a href=\"https://garden.weidok.al/notes/110-sermons/\">publishing them to my digital garden</a> to share with my friends since we usually talk about the sermon from the past week when we get together on Thursday evenings. I&rsquo;d like to write a post about how I&rsquo;m using Obsidian on my phone to take sermon notes. With markdown formatting, Obsidian is so much easier to to format on-the-fly than other note-taking apps I&rsquo;ve tried in the past. And I like digital better than analog for sermon notes because it&rsquo;s searchable, I can easily copy/paste snippets of scripture, and I can take pictures during the sermon if needed and add them into the notes.</p>\n<h3 id=\"lawn-care\">Lawn Care</h3>\n<p>That time of year has rolled around again&hellip; I&rsquo;m focused on lawn care. I have a lot to learn here! When our house was built two years ago, they didn&rsquo;t do a great job rockhounding the soil, so it&rsquo;s tough and rocky and the grass comes up in patches. I tried re-seeding last year which helped a little, but not too much. I think I need to aerate.</p>\n<p>Anyways, most of our grass is sickly but we had a couple of patches that grew up really fast and thick. They grew way quicker than I expected, so by the time I cut them they were too tall and I killed them so now we have some yellow patches in the back.</p>\n<p>We&rsquo;re planning to redo our flower beds soon. Those were installed for us but with no weed barrier or defined edge, so that has gotten out of control. I&rsquo;m going to re-edge it and put in some landscaping rock instead of mulch because I do not want to deal with mulch every year.</p>\n<h3 id=\"leisure\">Leisure</h3>\n<p>In between everything above, I&rsquo;m trying to make time for <a href=\"https://weidok.al/2024/04/28/beautiful-day-out.html\">disc golf with friends</a> every now and then so they don&rsquo;t pass me up :) I&rsquo;ve also been enjoying reading <a href=\"https://www.goodreads.com/book/show/29581.Foundation_and_Empire?from_search=true&amp;from_srp=true&amp;qid=Ko73QCm0g0&amp;rank=1\">&ldquo;Foundation and Empire&rdquo; by Isaac Asimov</a>.</p>\n<h3 id=\"exercise\">Exercise</h3>\n<p>Yeah&hellip;. Not been doing great here. With all my creative passion recently, I&rsquo;ve thrown exercise to the side. I&rsquo;m looking to change that though. The doc says I have elevated cholesterol and triglycerides, so it&rsquo;s time to take exercise seriously and back off the carbs. I&rsquo;m sad about taking time away from all the things above that I love, but there&rsquo;s plenty of &ldquo;gray&rdquo; time in my day where I&rsquo;m just distracted that I could take from instead. And I know from the past that getting into a good exercise routine will just bring me more energy and vigor, so it will be additive rather than subtractive. My wife and I tried some YouTube yoga together yesterday, but then as we were about to enter child&rsquo;s pose she noticed a small spider in front of her face and that abruptly ended our session!</p>",
				"content_text": "*Also available on my [/now page](https://weidok.al/now/)*\n\n<!--more-->\n\n### Dad Stuff\n\nMy daughter is 10 months old! Time is flying. It seems like she has learned something new every couple of days. As I write, the newest developments are that her top front teeth are coming in, she's loving waving and clapping, we're trying out cloth diapers, and when we ask her to say \"dada\" or \"mama\" she consistently replies \"dada\" to either.\n\nI'm soaking up every moment with her, particularly laying on the floor and letting her crawl over and attack me while we giggle together. I got teary-eyed the other day as I held her while she slept and I thought about how someday I won't be able to hold her anymore and these days will feel like a distant, warm memory. All the more reason to really be present, put the phone down, and take in each moment as completely as I can.\n\n### Creating\n\nI've been feeling extra creative lately! I've been writing on the blog, I set up a digital garden at [garden.weidok.al](https://garden.weidok.al), which I am mostly using to share my sermon notes and Readwise notes, and I created an app called [Fed Meetup](https://weidok.al/2024/05/03/introducing-fed-meetup.html)! I would have thought that becoming a dad meant I would have way less time, but somehow it has opened me up to being more creative. Funny how things work out not at all how I expect!\n\nI've also been considering starting up a newsletter. I like the idea of having a commitment to write weekly within a single topic, and writing about something that is useful to others. The newsletter would be for average computer users/office workers, and would be about tips to use a computer just a little bit better. Things like hotkeys, workflows, apps, lesser-known parts of the OS, or anything that could help people be just a touch more efficient on a computer. If that sounds like something you would read and subscribe to, [let me know](mailto:jake@weidok.al)!\n\n### Work\n\nWe launched the NASA Cause Analysis Tool! I've been the product manager for this app since it was approved to be funded back in April of last year, and it's hard for me to believe that we already have working production software! Now that it's released, we're focused on releasing it, again and again. There's a lot more functionality yet to be added, but I'm excited to have it available to users so we can get feedback as we build new increments. I'd like to write a post sharing more about this.\n\nIt's performance review time of the year at NASA, so I just finished up my self-assessment and feedback for coworkers. I'm learning to love this time of year, as it forces me to reflect on the past year, which is something I would like myself to do anyways. I'm thinking about writing a blog post about my highlights from this year at NASA.\n\nThere are so many exciting things going on right now, some of them I briefly mentioned in [my post about my day earlier this week](https://weidok.al/2024/04/30/a-day-in.html). While it's busy, I feel fortunate to be in this place at this time. I would have never thought I'd be doing all these cool things and working on projects that reach across the whole agency.\n\n### Faith and Friends\n\nSo many babies are being born! I'm not sure how many since my last update, but I think we've added around 5 new babies among our church group since then. It has been fun sharing the joy with everyone and helping out by participating in meal trains.\n\nI've been really enjoying taking sermon notes in Obsidian, and then [publishing them to my digital garden](https://garden.weidok.al/notes/110-sermons/) to share with my friends since we usually talk about the sermon from the past week when we get together on Thursday evenings. I'd like to write a post about how I'm using Obsidian on my phone to take sermon notes. With markdown formatting, Obsidian is so much easier to to format on-the-fly than other note-taking apps I've tried in the past. And I like digital better than analog for sermon notes because it's searchable, I can easily copy/paste snippets of scripture, and I can take pictures during the sermon if needed and add them into the notes. \n\n### Lawn Care\n\nThat time of year has rolled around again... I'm focused on lawn care. I have a lot to learn here! When our house was built two years ago, they didn't do a great job rockhounding the soil, so it's tough and rocky and the grass comes up in patches. I tried re-seeding last year which helped a little, but not too much. I think I need to aerate.\n\nAnyways, most of our grass is sickly but we had a couple of patches that grew up really fast and thick. They grew way quicker than I expected, so by the time I cut them they were too tall and I killed them so now we have some yellow patches in the back.\n\nWe're planning to redo our flower beds soon. Those were installed for us but with no weed barrier or defined edge, so that has gotten out of control. I'm going to re-edge it and put in some landscaping rock instead of mulch because I do not want to deal with mulch every year. \n\n### Leisure\n\nIn between everything above, I'm trying to make time for [disc golf with friends](https://weidok.al/2024/04/28/beautiful-day-out.html) every now and then so they don't pass me up :) I've also been enjoying reading [\"Foundation and Empire\" by Isaac Asimov](https://www.goodreads.com/book/show/29581.Foundation_and_Empire?from_search=true&from_srp=true&qid=Ko73QCm0g0&rank=1). \n\n### Exercise\n\nYeah.... Not been doing great here. With all my creative passion recently, I've thrown exercise to the side. I'm looking to change that though. The doc says I have elevated cholesterol and triglycerides, so it's time to take exercise seriously and back off the carbs. I'm sad about taking time away from all the things above that I love, but there's plenty of \"gray\" time in my day where I'm just distracted that I could take from instead. And I know from the past that getting into a good exercise routine will just bring me more energy and vigor, so it will be additive rather than subtractive. My wife and I tried some YouTube yoga together yesterday, but then as we were about to enter child's pose she noticed a small spider in front of her face and that abruptly ended our session!\n",
				"date_published": "2024-05-05T06:47:34-04:00",
				"url": "https://weidok.al/2024/05/05/now.html",
				"tags": ["now","articles","obsidian"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/03/introducing-fed-meetup.html",
				"title": "Introducing Fed Meetup",
				"content_html": "<p>Now that we are out of the pandemic, federal travel is back in full swing. Federal employees are flying cross-country to get together and meet on various topics to do their work more effectively. I see this, especially at my organization, NASA. Just this winter I flew out to Kennedy Space Center for the Office of Safety and Mission Assurance Face-to-Face with more than 50 other colleagues to talk about where the organization is going and to do workshops together. We do these twice a year.</p>\n<p>Multiply 2x per year times the number of employees traveling, and then multiply that by all the other sub-organizations at NASA doing similar events and that adds up to a LOT of annual travel costs. But NASA is just one piece of the federal puzzle and a rather small piece at that. In 2023 NASA&rsquo;s $28.3 billion budget only accounted for 0.3% of the federal budget as shown in this graphic from <a href=\"https://www.usaspending.gov/explorer/agency\">usaspending.gov</a>.</p>\n<!-- raw HTML omitted -->\n<h2 id=\"the-challenge-of-planning-group-travel\">The Challenge of Planning Group Travel</h2>\n<p>Planning travel for large organizations is hard. When you combine the number of different origins travelers will be coming from with the different destinations they could travel to, it becomes difficult to understand the combinations. How do you compare the costs of your destinations? Right now, this is done by gut feel.</p>\n<p>Closer destinations or ones that already have people living there are probably cheaper, right? Well, usually, yes, in simple situations. But not always, and this can get complex when you have different amounts of travelers living in various potential destinations. Or what if you have people all across the country? How do you triangulate and weigh the &ldquo;closest&rdquo; city between all travelers? Not to mention some farther cities have cheaper airfare costs than closer cities. AND to even further complicate it, you need to consider each city&rsquo;s cost of living, which contributes to Meals &amp; Incidentals Expenses.</p>\n<p>Do you have a headache too?</p>\n<h2 id=\"introducing-fed-meetup\">Introducing Fed Meetup</h2>\n<p>I created <a href=\"https://fedmeetup.com\">Fed Meetup</a> to help federal travel planners optimize their destinations for large in-person meetings. It uses publicly available city pair and per diem rate data to compare travel costs for in-person events across multiple destinations.</p>\n<!-- raw HTML omitted -->\n<h3 id=\"how-does-it-work\">How Does It Work?</h3>\n<p>First, enter how many <strong>days</strong> long the event will be and the <strong>month</strong> of travel. This is used to calculate per diem rates, which fluctuate in some locations based on the month.</p>\n<p>Next, input the various <strong>origins</strong> each traveler will be coming from, along with the number of travelers coming from the origin. Right now, you can specify an origin as either a NASA Center or an Airport. In the future, I plan to provide other predefined origins for agencies other than NASA. If you work at an agency and want your locations added to their own list, reach out to me and I&rsquo;d be happy to work with you.</p>\n<p>Once you have entered your origins, it&rsquo;s time to select the <strong>destinations</strong> you would like to compare. There are two options for adding destinations:</p>\n<ol>\n<li>Add bulk destinations from a preset (currently the only option is All NASA Centers. I plan to add locations for other agencies in the future)</li>\n<li>Add individual destinations by airport or NASA Center.</li>\n</ol>\n<p>After you&rsquo;ve followed the steps above, you&rsquo;re ready to <strong>submit</strong> and let Fed Meetup work its magic! Fed Meetup will run its calculations and provide you with a ranked list of destinations from cheapest to most expensive. If a direct flight can not be found for an origin-destination pair, that destination is ranked lower in the results and marked with an asterisk to indicate the total cost does not include airfare for that origin-destination pair. For each result, you can see the total cost, airfare cost, and per diem cost.</p>\n<h3 id=\"why-build-this\">Why Build This?</h3>\n<p>Fed Meetup was born out of a <a href=\"https://www.nasa.gov/directorates/stmd/stmd-prizes-challenges-crowdsourcing-program/center-of-excellence-for-collaborative-innovation-coeci/nasa-spark/\">NASA Spark</a> campaign. The campaign was looking for existing tools that could be used to evaluate the best meeting locations for large meetings, specifically using federal city-pair and per diem rates. No such tool existed, so I decided to build my own. I was looking for a fun side project that was useful, so this was a great fit! All-in it took me about 15 hours to build this app. I&rsquo;m proud that I was able to get it completed within the two-week timeframe I had before the Spark campaign closed, but there is a lot that I would like to improve.</p>\n<h3 id=\"future-plans\">Future Plans</h3>\n<p>Remember how NASA was only 0.3% of the federal budget? My grand vision for Fed Meetup is to get it into the hands of as many federal agencies as I can. It&rsquo;s free and open to anyone to use, so my hope is that agencies will find it useful and adopt it to make their travel spending more efficient. All Americans benefit when taxpayer dollars are used more prudently.</p>\n<p>To make that grand vision possible, there are lots of little improvements I&rsquo;d like to make. This is more of a grocery list than a roadmap, but you have to start somewhere, right?</p>\n<ul>\n<li>🎨 Improve the design. Right now it is very wordy. Experience is not as good on mobile. Simplify the interface and make it more intuitive.</li>\n<li>🏙 Allow users to select cities as origins and destinations.</li>\n<li>✈Related to the above, for cities that have multiple airports (Washington D.C.) the tool would select the cheapest airport pair for that city.</li>\n<li>🧮 Update the results to show more info about how the calculation was made. This would allow users to fact-check the results and trust them more.</li>\n<li>❗ Improve form validation when there are input errors, so it is clear what needs to be changed.</li>\n<li>ℹ Add an &ldquo;About&rdquo; page that describes the tool and why it exists - link to this post???</li>\n<li>🏛 Add preset origins/destinations for other agencies (e.g., &ldquo;All Department of Energy Locations&rdquo;). 💡 If you are from another agency, please reach out and help me get the locations set up for your agency!</li>\n<li>🍃 Consider carbon footprint in the calculation and results. I would need a data source for these calculations. I have not looked into this yet.</li>\n<li>🚗 If traveling between close cities, calculate Privately Owned Vehicle mileage and compare it with airfare prices.</li>\n</ul>\n<h2 id=\"now-what\">Now What?</h2>\n<p>Time to spread the word! I&rsquo;ll be out evangelizing Fed Meetup to those who need to know about it. If you work in a federal agency, send it to the person in your area who organizes travel. Have them try it out.</p>\n<p>If you use Fed Meetup, send me some feedback. My email inbox and LinkedIn DMs are open!</p>\n<p>Safe travels!</p>",
				"content_text": "Now that we are out of the pandemic, federal travel is back in full swing. Federal employees are flying cross-country to get together and meet on various topics to do their work more effectively. I see this, especially at my organization, NASA. Just this winter I flew out to Kennedy Space Center for the Office of Safety and Mission Assurance Face-to-Face with more than 50 other colleagues to talk about where the organization is going and to do workshops together. We do these twice a year.\n\n<!--more-->\n\nMultiply 2x per year times the number of employees traveling, and then multiply that by all the other sub-organizations at NASA doing similar events and that adds up to a LOT of annual travel costs. But NASA is just one piece of the federal puzzle and a rather small piece at that. In 2023 NASA's $28.3 billion budget only accounted for 0.3% of the federal budget as shown in this graphic from [usaspending.gov](https://www.usaspending.gov/explorer/agency).\n\n<img src=\"https://cdn.uploads.micro.blog/139317/2024/img-20240503141633685.png\" width=\"600\" height=\"308\" alt=\"\">\n\n## The Challenge of Planning Group Travel\n\nPlanning travel for large organizations is hard. When you combine the number of different origins travelers will be coming from with the different destinations they could travel to, it becomes difficult to understand the combinations. How do you compare the costs of your destinations? Right now, this is done by gut feel.\n\nCloser destinations or ones that already have people living there are probably cheaper, right? Well, usually, yes, in simple situations. But not always, and this can get complex when you have different amounts of travelers living in various potential destinations. Or what if you have people all across the country? How do you triangulate and weigh the \"closest\" city between all travelers? Not to mention some farther cities have cheaper airfare costs than closer cities. AND to even further complicate it, you need to consider each city's cost of living, which contributes to Meals & Incidentals Expenses.\n\nDo you have a headache too?\n\n## Introducing Fed Meetup\n\nI created [Fed Meetup](https://fedmeetup.com) to help federal travel planners optimize their destinations for large in-person meetings. It uses publicly available city pair and per diem rate data to compare travel costs for in-person events across multiple destinations.\n\n<img src=\"https://cdn.uploads.micro.blog/139317/2024/img-20240503144841249.png\" width=\"600\" height=\"307\" alt=\"\">\n\n### How Does It Work?\n\nFirst, enter how many **days** long the event will be and the **month** of travel. This is used to calculate per diem rates, which fluctuate in some locations based on the month.\n\nNext, input the various **origins** each traveler will be coming from, along with the number of travelers coming from the origin. Right now, you can specify an origin as either a NASA Center or an Airport. In the future, I plan to provide other predefined origins for agencies other than NASA. If you work at an agency and want your locations added to their own list, reach out to me and I'd be happy to work with you.\n\nOnce you have entered your origins, it's time to select the **destinations** you would like to compare. There are two options for adding destinations:\n1. Add bulk destinations from a preset (currently the only option is All NASA Centers. I plan to add locations for other agencies in the future)\n2. Add individual destinations by airport or NASA Center.\n\nAfter you've followed the steps above, you're ready to **submit** and let Fed Meetup work its magic! Fed Meetup will run its calculations and provide you with a ranked list of destinations from cheapest to most expensive. If a direct flight can not be found for an origin-destination pair, that destination is ranked lower in the results and marked with an asterisk to indicate the total cost does not include airfare for that origin-destination pair. For each result, you can see the total cost, airfare cost, and per diem cost.\n\n### Why Build This?\n\nFed Meetup was born out of a [NASA Spark](https://www.nasa.gov/directorates/stmd/stmd-prizes-challenges-crowdsourcing-program/center-of-excellence-for-collaborative-innovation-coeci/nasa-spark/) campaign. The campaign was looking for existing tools that could be used to evaluate the best meeting locations for large meetings, specifically using federal city-pair and per diem rates. No such tool existed, so I decided to build my own. I was looking for a fun side project that was useful, so this was a great fit! All-in it took me about 15 hours to build this app. I'm proud that I was able to get it completed within the two-week timeframe I had before the Spark campaign closed, but there is a lot that I would like to improve.\n\n### Future Plans\n\nRemember how NASA was only 0.3% of the federal budget? My grand vision for Fed Meetup is to get it into the hands of as many federal agencies as I can. It's free and open to anyone to use, so my hope is that agencies will find it useful and adopt it to make their travel spending more efficient. All Americans benefit when taxpayer dollars are used more prudently.\n\nTo make that grand vision possible, there are lots of little improvements I'd like to make. This is more of a grocery list than a roadmap, but you have to start somewhere, right?\n\n- 🎨 Improve the design. Right now it is very wordy. Experience is not as good on mobile. Simplify the interface and make it more intuitive.\n- 🏙 Allow users to select cities as origins and destinations.\n- ✈Related to the above, for cities that have multiple airports (Washington D.C.) the tool would select the cheapest airport pair for that city.\n- 🧮 Update the results to show more info about how the calculation was made. This would allow users to fact-check the results and trust them more.\n- ❗ Improve form validation when there are input errors, so it is clear what needs to be changed.\n- ℹ Add an \"About\" page that describes the tool and why it exists - link to this post???\n- 🏛 Add preset origins/destinations for other agencies (e.g., \"All Department of Energy Locations\"). 💡 If you are from another agency, please reach out and help me get the locations set up for your agency!\n- 🍃 Consider carbon footprint in the calculation and results. I would need a data source for these calculations. I have not looked into this yet.\n- 🚗 If traveling between close cities, calculate Privately Owned Vehicle mileage and compare it with airfare prices.\n\n## Now What?\n\nTime to spread the word! I'll be out evangelizing Fed Meetup to those who need to know about it. If you work in a federal agency, send it to the person in your area who organizes travel. Have them try it out.\n\nIf you use Fed Meetup, send me some feedback. My email inbox and LinkedIn DMs are open!\n\nSafe travels!\n",
				"date_published": "2024-05-03T15:26:39-04:00",
				"url": "https://weidok.al/2024/05/03/introducing-fed-meetup.html",
				"tags": ["articles"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/05/01/i-cant-tell.html",
				
				"content_html": "<p>I can&rsquo;t tell you the number of people I&rsquo;ve saved by muting them when they unintentionally had their mics open on a call with 100+ participants. I just muted someone who accidentally interrupted a large meeting talking about a fly that had gotten into their house 🤦‍♂️</p>\n<p>Not all heroes wear capes&hellip;</p>\n",
				"content_text": "I can't tell you the number of people I've saved by muting them when they unintentionally had their mics open on a call with 100+ participants. I just muted someone who accidentally interrupted a large meeting talking about a fly that had gotten into their house 🤦‍♂️\r\n\r\nNot all heroes wear capes...\n",
				"date_published": "2024-05-01T11:01:05-04:00",
				"url": "https://weidok.al/2024/05/01/i-cant-tell.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/04/30/a-day-in.html",
				"title": "A Day In My Life At NASA",
				"content_html": "<p>On days like today,  I marvel as I reflect all the awesome things I get to do in my role here at the NASA Safety Center.</p>\n<p>Today I&hellip;</p>\n<p>🐛 Hosted a &ldquo;bug hunt&rdquo; for the new app we launched last month, having the whole development team try to break the app to catch bugs before they become an issue.</p>\n<p>🌒 Spoke with someone from the Human Landing System program about their interest in using a fishbone (Ishikawa) diagram to identify what could cause the lunar lander to tip over during landing. This is a problem that has plagued recent commercial lunar landings, and we are looking to support these use cases in our new app.</p>\n<p>🥗 Ate a fantastic salad with my team at the café in the new Research Support Building at NASA Glenn Research Center</p>\n<p>🤹‍♀️ Consulted with a co-worker about how we could use Microsoft Delve to surface Reliability Engineers in the agency with unique skills that could be shared with others in that discipline.</p>\n<p>📊 Reviewed the Science Mission Directorate&rsquo;s system for tracking risks to inform how our team will build an agency-level tool that surfaces elevated risks from the mission directorates.</p>\n<p>👬 Demoed our API for mishap data to a group building a Digital Twin of NASA facilities. Mishap data could be layered with information we have on aging infrastructure to build a compelling case for which areas of NASA&rsquo;s infrastructure are in the most need of attention.</p>\n<p>And that all is just the tip of the iceberg! Looking forward to tomorrow!</p>\n",
				"content_text": "On days like today,  I marvel as I reflect all the awesome things I get to do in my role here at the NASA Safety Center.\n\nToday I...\n\n🐛 Hosted a \"bug hunt\" for the new app we launched last month, having the whole development team try to break the app to catch bugs before they become an issue.\n\n🌒 Spoke with someone from the Human Landing System program about their interest in using a fishbone (Ishikawa) diagram to identify what could cause the lunar lander to tip over during landing. This is a problem that has plagued recent commercial lunar landings, and we are looking to support these use cases in our new app.\n\n🥗 Ate a fantastic salad with my team at the café in the new Research Support Building at NASA Glenn Research Center\n\n🤹‍♀️ Consulted with a co-worker about how we could use Microsoft Delve to surface Reliability Engineers in the agency with unique skills that could be shared with others in that discipline.\n\n📊 Reviewed the Science Mission Directorate's system for tracking risks to inform how our team will build an agency-level tool that surfaces elevated risks from the mission directorates.\n\n👬 Demoed our API for mishap data to a group building a Digital Twin of NASA facilities. Mishap data could be layered with information we have on aging infrastructure to build a compelling case for which areas of NASA's infrastructure are in the most need of attention.\n\nAnd that all is just the tip of the iceberg! Looking forward to tomorrow!\n",
				"date_published": "2024-04-30T22:22:51-04:00",
				"url": "https://weidok.al/2024/04/30/a-day-in.html",
				"tags": ["articles"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/04/28/beautiful-day-out.html",
				
				"content_html": "<p>Beautiful day out on the course today. Playing an informal tournament with friends where we&rsquo;ll be playing 4 courses in one day! 😯 Time to get some steps in&hellip;</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Beautiful day out on the course today. Playing an informal tournament with friends where we'll be playing 4 courses in one day! 😯 Time to get some steps in...\n\n<img src=\"https://cdn.uploads.micro.blog/139317/2024/3bd7273a69.jpg\" width=\"600\" height=\"450\" alt=\"A disc golf basket raised on top of a mini lighthouse with a lake in the background.\">\n",
				"date_published": "2024-04-28T10:45:56-04:00",
				"url": "https://weidok.al/2024/04/28/beautiful-day-out.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/04/27/i-listened-to.html",
				
				"content_html": "<p>I listened to <a href=\"https://www.shakeygraves.com/\">Shakey Graves</a> this morning while washing a mountain of dishes. I like whatever genre this is. Folk? I feel like I stumbled on something new to me, which is always exciting and fun! Opens up a new little world to explore. I welcome any artist/album suggestions like this! 🎶</p>\n",
				"content_text": "I listened to [Shakey Graves](https://www.shakeygraves.com/) this morning while washing a mountain of dishes. I like whatever genre this is. Folk? I feel like I stumbled on something new to me, which is always exciting and fun! Opens up a new little world to explore. I welcome any artist/album suggestions like this! 🎶\n",
				"date_published": "2024-04-27T07:18:33-04:00",
				"url": "https://weidok.al/2024/04/27/i-listened-to.html",
				"tags": ["notes"]
			},
			{
				"id": "http://jakeweidokal.micro.blog/2024/04/24/every-now-and.html",
				
				"content_html": "<p>Every now and then LinkedIn asks me to contribute to these collaborative articles, which have AI-generated content that humans respond to. This one was funny and unsettling&hellip; AI wants me to embrace AI if it disrupts my job&hellip; 🤔</p>\n<p>p.s. This is actually good advice. Just feels weird coming from AI.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Every now and then LinkedIn asks me to contribute to these collaborative articles, which have AI-generated content that humans respond to. This one was funny and unsettling... AI wants me to embrace AI if it disrupts my job... 🤔\n\np.s. This is actually good advice. Just feels weird coming from AI.\n\n<img src=\"https://cdn.uploads.micro.blog/139317/2024/d347734798.png\" width=\"276\" height=\"600\" alt=\"A screenshot showing the question &quot;what do you do if artificial intelligence disrupts the web industry?&quot; With the top answer being &quot;Embrace AI&quot;\">\n",
				"date_published": "2024-04-24T16:45:04-04:00",
				"url": "https://weidok.al/2024/04/24/every-now-and.html",
				"tags": ["notes"]
			}
	]
}
